Repository: interaktivgmbh/interaktiv.kyra
Catalog: src/interaktiv/kyra/locales/*/LC_MESSAGES/interaktiv.kyra.po
Languages: de

# trans_label_controlpanel_ai_assistant_settings
source: AI Assistant Settings
de: KI Assistent Einstellungen

# trans_label_controlpanel_ai_prompt_manager
source: AI Prompt Manager
de: KI Prompt Manager

# trans_help_gateway_url
source: The base URL of your AI prompt gateway API endpoint
de: Die Basis-URL des KI-Prompt-Gateway-API-Endpunkts

# trans_help_keycloak_realms_url
source: The Keycloak realm URL for authentication (e.g., https://auth.example.com/realms/your-realm)
de: Die Keycloak-Realm-URL für die Authentifizierung (z.B. https://auth.example.com/realms/ihr-realm)

# trans_help_keycloak_client_id
source: The client identifier registered in Keycloak for this application
de: Die in Keycloak registrierte Client-Kennung für diese Anwendung

# trans_help_keycloak_client_secret
source: The confidential client secret for Keycloak authentication
de: Das vertrauliche Client-Secret für die Keycloak-Authentifizierung

# trans_help_domain_id
source: Unique identifier for this portal instance, used to organize prompts by site
de: Eindeutige Kennung für diese Portal-Instanz, wird zur Organisation von Prompts nach Website verwendet

# trans_help_keycloak_token_value
source: This field is set automatically!
de: Dieses Feld wird automatisch gesetzt!

# trans_help_keycloak_token_timestamp
source: This field is set automatically!
de: Dieses Feld wird automatisch gesetzt!

# trans_heading_ai_prompt_manager
source: AI Prompt Manager
de: KI Prompt Manager

# trans_description_prompt_manager
source: Manage AI prompts for the TinyMCE editor. Create, edit and delete prompts.
de: Verwalten Sie KI-Prompts für den TinyMCE Editor. Erstellen, bearbeiten und löschen Sie Anweisungen.

# trans_legend_create_new_prompt
source: Create New Prompt
de: Neuen Prompt erstellen

# trans_placeholder_prompt_name
source: e.g. Translate to Spanish
de: z.B. Ins Spanische übersetzen

# trans_placeholder_prompt_description
source: Optional description of what this prompt does...
de: Optionale Beschreibung, was dieser Prompt macht...

# trans_placeholder_prompt_text
source: e.g. Translate the following text to Spanish...
de: z.B. Übersetze den folgenden Text ins Spanische...

# trans_placeholder_prompt_categories
source: e.g. Translation, Languages
de: z.B. Übersetzung, Sprachen

# trans_button_create_prompt
source: Create Prompt
de: Prompt erstellen

# trans_heading_existing_prompts
source: Existing Prompts
de: Vorhandene Prompts

# trans_table_header_description
source: Description
de: Beschreibung

# trans_table_header_categories
source: Categories
de: Kategorien

# trans_table_header_action
source: Action
de: Aktion

# trans_table_header_actions
source: Actions
de: Aktionen

# trans_button_edit
source: Edit
de: Bearbeiten

# trans_button_delete
source: Delete
de: Löschen

# trans_no_prompts_found
source: No prompts found. Create a new prompt above.
de: Keine Prompts gefunden. Erstellen Sie einen neuen Prompt oben.

# trans_button_create_new_prompt
source: Create Prompt
de: Prompt erstellen

# trans_button_hide_form
source: Hide form
de: Ausblenden

# trans_heading_edit_prompt
source: Edit Prompt
de: Prompt bearbeiten

# trans_label_prompt_description
source: Description
de: Beschreibung

# trans_label_prompt_categories
source: Categories (comma-separated)
de: Kategorien (kommagetrennt)

# trans_label_prompt_action
source: Action
de: Aktion

# trans_option_action_replace
source: Replace
de: Ersetzen

# trans_option_action_append
source: Append
de: Anhängen

# trans_button_save_changes
source: Save Changes
de: Änderungen speichern

# trans_button_cancel
source: Cancel
de: Abbrechen

# trans_error_prompt_not_loaded
source: Prompt could not be loaded.
de: Prompt konnte nicht geladen werden.

# trans_link_back_to_overview
source: Back to Overview
de: Zurück zur Übersicht

# trans_status_prompt_created
source: Prompt was successfully created
de: Prompt wurde erfolgreich erstellt

# trans_status_prompt_deleted
source: Prompt was successfully deleted
de: Prompt wurde erfolgreich gelöscht

# trans_status_prompt_updated
source: Prompt was successfully updated
de: Prompt wurde erfolgreich aktualisiert

# trans_status_no_prompt_id
source: No prompt ID provided
de: Keine Prompt-ID angegeben

# trans_error_missing_name_or_prompt
source: Value for name or prompt is missing
de: Wert für Name oder Prompt fehlt

# trans_error_missing_ids
source: Missing prompt ID or file ID
de: Prompt-ID oder Datei-ID fehlt

# trans_status_file_deleted
source: File successfully deleted
de: Datei erfolgreich gelöscht

# trans_legend_upload_files
source: Upload Files (Optional)
de: Dateien hochladen (Optional)

# trans_label_select_files
source: Select Files
de: Dateien auswählen

# trans_help_file_upload
source: Upload documents, images, or other files to provide context for this prompt.
de: Laden Sie Dokumente, Bilder oder andere Dateien hoch, um Kontext für diesen Prompt bereitzustellen.

# trans_heading_attached_files
source: Attached Files
de: Angehängte Dateien

# trans_table_header_filename
source: Filename
de: Dateiname

# trans_table_header_size
source: Size
de: Größe

# trans_table_header_uploaded
source: Uploaded
de: Hochgeladen

# trans_no_files_attached
source: No files attached to this prompt yet.
de: Diesem Prompt sind noch keine Dateien zugeordnet.

# trans_unknown
source: Unknown
de: Unbekannt

# trans_ai_assistant_no_prompts
source: No prompts available
de: Keine Anweisungen verfügbar

# trans_ai_assistant_no_prompts_message
source: No AI prompts found. Create prompts via the API.
de: Keine KI-Anweisungen gefunden. Erstellen Sie Anweisungen über die API.

# trans_ai_assistant_loading_error
source: Loading error
de: Fehler beim Laden

# trans_ai_assistant_loading_error_message
source: Error loading AI prompts. Check the API connection.
de: Fehler beim Laden der KI-Anweisungen. Überprüfen Sie die API-Verbindung.

# trans_ai_assistant_fetch_error
source: Error loading AI prompts: {error}
de: Fehler beim Laden der KI-Anweisungen: {error}

# trans_ai_assistant_processing
source: ‚è≥ AI prompt is being processed... This may take a moment.
de: ⏳ KI-Anweisung wird verarbeitet... Dies kann einen Moment dauern.

# trans_ai_assistant_apply_error
source: Error applying prompt: {error}
de: Fehler beim Anwenden der Anweisung: {error}

# trans_ai_assistant_select_text_warning
source: Please select text first.
de: Bitte wählen Sie zuerst Text aus.

# trans_ai_assistant_select_text_for_prompt
source: Please select text first to apply the prompt.
de: Bitte wählen Sie zuerst Text aus, um die Anweisung anzuwenden.

# trans_ai_assistant_success
source: "{name}" applied successfully.
de: "{name}" erfolgreich angewendet.

# trans_ai_assistant_manual_prompt_unavailable
source: AI Manual Prompt Extension is not available.
de: AI Manual Prompt Extension ist nicht verfügbar.

# trans_ai_assistant_category_uncategorized
source: Uncategorized
de: Unkategorisiert
